In [2]:
%load_ext sql

In [3]:
%sql sqlite:///hw_1.db

In [4]:
%sql PRAGMA foreign_keys = ON;

 * sqlite:///hw_1.db
Done.

[]

In [9]:
%%sql -- Problem 1 

create table branch(
    branch_name varchar(20),
    branch_city varchar(30) not null,
    assets numeric(10,2),
    primary key(branch_name)
);

create table account (
    account_number char(5),
    branch_name varchar(20),
    balance numeric(8,2),
    primary key(account_number),
    foreign key(branch_name) references branch on delete cascade
);

create table customer(
    customer_name varchar(20),
    customer_street varchar(30) not null,
    customer_city varchar(30) not null,
    primary key (customer_name)
);

create table depositor(
    customer_name varchar(20),
    account_number char(5),
    primary key (customer_name, account_number),
    foreign key (customer_name) references customer on delete cascade,
    foreign key (account_number) references account on delete cascade
);

create table loan (
    loan_number char(7),
    branch_name varchar(20),
    amount numeric(8,2),
    primary key (loan_number),
    foreign key (branch_name) references branch on delete cascade
);

create table borrower(
    customer_name varchar(20),
    loan_number char(7),
    primary key (customer_name, loan_number),
    foreign key (customer_name) references customer on delete cascade,
    foreign key (loan_number) references loan on delete cascade
);

 * sqlite:///hw_1.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [10]:
%%sql -- Problem 2 - (1)
insert into branch values('BNU','Busan',90000),
                        ('GIST','Gwangju',65000),
                        ('SNU','Seoul',75000),
                        ('GNU','Gwangju',35000),
                        ('Chumdan','Gwangju',50000),
                        ('Suwan','Gwangju',85000),
                        ('Kaist','Daejeon',60000);
                        
insert into loan values ('L-20141','GIST',1000),
                        ('L-20114','GIST',500),
                        ('L-20112','GIST',3800),
                        ('L-20143','GIST',1400),
                        ('L-30188','SNU',200),
                        ('L-30163','SNU',2700),
                        ('L-30179','SNU',1200),
                        ('L-30175','SNU',3900),
                        ('L-40144','BNU',2600),
                        ('L-40183','BNU',3600),
                        ('L-40120','BNU',7200),
                        ('L-20201','GIST',73000),
                        ('L-20210','GIST',78000),
                        ('L-20831','GIST',71500),
                        ('L-30195','SNU',70600),
                        ('L-40450','BNU',79500),
                        ('L-40710','BNU',73400);
                        
insert into customer values
    ('James','gyungsu','seoul'),
    ('Choi','paldal','seoul'),
    ('Smith','gwagi','seoul'),
    ('Lee','gwagi','anyang'),
    ('Jung','chumdan','ulsan'),
    ('Kim','chumdan','gwangju'),
    ('Hwang','chumdan','gwangu'),
    
    
    ('Jang','doro','daegu'),
    ('Won','sugu','busan'),
    ('Sun','gumnam','daejun'),
    ('Hye','saga','daejun'),
    
    ('Hae','chumdan','gwangju'),
    ('Eun','chumdan','gwangju'),
    ('Myeong','bundang','Sungnam'),
    ('Ill','treeroad','Seoul'),
    ('Sung','gyeungsu','anyang'),
    ('Man','gyeungsu','anyang'),
    ('Gang','jiduck','anyang'),
    ('Suek','Eun','busan'),
    ('Hyo','Eun','busan');
    
insert into borrower values ('Jung','L-20112'),
('Lee','L-20143'),
('Kim','L-20114'),
('Hwang','L-20141'),
('James','L-30188'),
('Choi','L-30163'),
('Smith','L-30179'),
('Jang','L-30175'),
('Won','L-40144'),
('Sun','L-40183'),
('Hye','L-40120'),
('Jung','L-20201'),
('Jung','L-20210'),
('Hwang','L-20831'),
('Smith','L-30195'),
('Sun','L-40450'),
('Hye','L-40710');

insert into account values
    ('10001','Kaist',990),
    ('40001','BNU',1400),
    ('20001','GIST',1330),
    ('10002','Kaist',1430),
    ('20002','GIST',920),
    ('20003','GIST',1020),
    ('60001','Chumdan',960),
    ('30001','SNU',1030),
    ('30002','SNU',1260),
    ('20004','GIST',870),
    ('50001','Suwan',1060),
    ('50002','Suwan',860),
    ('50003','Suwan',1290),
    
    ('70001','GNU',1320),
    ('60002','Chumdan',1580),
    ('50004','Suwan',1145),
    
    ('70002','GNU',1400),
    ('60003','Chumdan',1120),
    ('50005','Suwan',920);
    
insert into depositor values
    ('Jang','10001'),
    ('Won','40001'),
    ('Sun','20001'),
    ('Hye','10002'),
    ('Hae','20002'),
    ('Eun','20003'),
    ('Myeong','60001'),
    ('Ill','30001'),
    ('Sung','30002'),
    ('Man','20004'),
    ('Gang','50001'),
    ('Suek','50002'),
    ('Hyo','50003'),
    
    ('Sun','70001'),
    ('Sun','60002'),
    ('Sun','50004'),
    
    ('Eun','70002'),
    ('Eun','60003'),
    ('Eun','50005');

 * sqlite:///hw_1.db
7 rows affected.
17 rows affected.
20 rows affected.
17 rows affected.
19 rows affected.
19 rows affected.

[]

In [11]:
%%sql -- Problem 2 - (2)
select *
from branch

 * sqlite:///hw_1.db
Done.

[('BNU', 'Busan', 90000),
 ('GIST', 'Gwangju', 65000),
 ('SNU', 'Seoul', 75000),
 ('GNU', 'Gwangju', 35000),
 ('Chumdan', 'Gwangju', 50000),
 ('Suwan', 'Gwangju', 85000),
 ('Kaist', 'Daejeon', 60000)]

In [12]:
%%sql -- Problem 2 - (3)
select *
from customer

 * sqlite:///hw_1.db
Done.

[('James', 'gyungsu', 'seoul'),
 ('Choi', 'paldal', 'seoul'),
 ('Smith', 'gwagi', 'seoul'),
 ('Lee', 'gwagi', 'anyang'),
 ('Jung', 'chumdan', 'ulsan'),
 ('Kim', 'chumdan', 'gwangju'),
 ('Hwang', 'chumdan', 'gwangu'),
 ('Jang', 'doro', 'daegu'),
 ('Won', 'sugu', 'busan'),
 ('Sun', 'gumnam', 'daejun'),
 ('Hye', 'saga', 'daejun'),
 ('Hae', 'chumdan', 'gwangju'),
 ('Eun', 'chumdan', 'gwangju'),
 ('Myeong', 'bundang', 'Sungnam'),
 ('Ill', 'treeroad', 'Seoul'),
 ('Sung', 'gyeungsu', 'anyang'),
 ('Man', 'gyeungsu', 'anyang'),
 ('Gang', 'jiduck', 'anyang'),
 ('Suek', 'Eun', 'busan'),
 ('Hyo', 'Eun', 'busan')]

In [13]:
%%sql -- Problem 2 - (4)
select *
from loan

 * sqlite:///hw_1.db
Done.

[('L-20141', 'GIST', 1000),
 ('L-20114', 'GIST', 500),
 ('L-20112', 'GIST', 3800),
 ('L-20143', 'GIST', 1400),
 ('L-30188', 'SNU', 200),
 ('L-30163', 'SNU', 2700),
 ('L-30179', 'SNU', 1200),
 ('L-30175', 'SNU', 3900),
 ('L-40144', 'BNU', 2600),
 ('L-40183', 'BNU', 3600),
 ('L-40120', 'BNU', 7200),
 ('L-20201', 'GIST', 73000),
 ('L-20210', 'GIST', 78000),
 ('L-20831', 'GIST', 71500),
 ('L-30195', 'SNU', 70600),
 ('L-40450', 'BNU', 79500),
 ('L-40710', 'BNU', 73400)]

In [14]:
%%sql -- Problem 2 - (5)
select *
from borrower

 * sqlite:///hw_1.db
Done.

[('Jung', 'L-20112'),
 ('Lee', 'L-20143'),
 ('Kim', 'L-20114'),
 ('Hwang', 'L-20141'),
 ('James', 'L-30188'),
 ('Choi', 'L-30163'),
 ('Smith', 'L-30179'),
 ('Jang', 'L-30175'),
 ('Won', 'L-40144'),
 ('Sun', 'L-40183'),
 ('Hye', 'L-40120'),
 ('Jung', 'L-20201'),
 ('Jung', 'L-20210'),
 ('Hwang', 'L-20831'),
 ('Smith', 'L-30195'),
 ('Sun', 'L-40450'),
 ('Hye', 'L-40710')]

In [15]:
%%sql -- Problem 2 - (6)
select *
from account

 * sqlite:///hw_1.db
Done.

[('10001', 'Kaist', 990),
 ('40001', 'BNU', 1400),
 ('20001', 'GIST', 1330),
 ('10002', 'Kaist', 1430),
 ('20002', 'GIST', 920),
 ('20003', 'GIST', 1020),
 ('60001', 'Chumdan', 960),
 ('30001', 'SNU', 1030),
 ('30002', 'SNU', 1260),
 ('20004', 'GIST', 870),
 ('50001', 'Suwan', 1060),
 ('50002', 'Suwan', 860),
 ('50003', 'Suwan', 1290),
 ('70001', 'GNU', 1320),
 ('60002', 'Chumdan', 1580),
 ('50004', 'Suwan', 1145),
 ('70002', 'GNU', 1400),
 ('60003', 'Chumdan', 1120),
 ('50005', 'Suwan', 920)]

In [16]:
%%sql -- Problem 2 - (7)
select *
from depositor

 * sqlite:///hw_1.db
Done.

[('Jang', '10001'),
 ('Won', '40001'),
 ('Sun', '20001'),
 ('Hye', '10002'),
 ('Hae', '20002'),
 ('Eun', '20003'),
 ('Myeong', '60001'),
 ('Ill', '30001'),
 ('Sung', '30002'),
 ('Man', '20004'),
 ('Gang', '50001'),
 ('Suek', '50002'),
 ('Hyo', '50003'),
 ('Sun', '70001'),
 ('Sun', '60002'),
 ('Sun', '50004'),
 ('Eun', '70002'),
 ('Eun', '60003'),
 ('Eun', '50005')]

In [58]:
%%sql -- Problem 3
select loan_number
from loan
where branch_name = 'GIST' and amount > 2000

 * sqlite:///hw_1.db
Done.

[('L-20112',), ('L-20201',), ('L-20210',), ('L-20831',)]

In [17]:
%%sql -- Problem 4
select *
from customer
where customer_name in (
select distinct customer_name
from borrower, loan
where borrower.loan_number = loan.loan_number and branch_name = 'GIST')
order by customer_name

 * sqlite:///hw_1.db
Done.

[('Hwang', 'chumdan', 'gwangu'),
 ('Jung', 'chumdan', 'ulsan'),
 ('Kim', 'chumdan', 'gwangju'),
 ('Lee', 'gwagi', 'anyang')]

In [18]:
%%sql -- Problem 5
select loan_number
from loan
where amount between 70000 and 80000

 * sqlite:///hw_1.db
Done.

[('L-20201',),
 ('L-20210',),
 ('L-20831',),
 ('L-30195',),
 ('L-40450',),
 ('L-40710',)]

In [22]:
%%sql -- Problem 6
select distinct T.branch_name
from branch as T, branch as S
where S.branch_city = 'Gwangju' and T.assets > S.assets

 * sqlite:///hw_1.db
Done.

[('BNU',), ('Chumdan',), ('GIST',), ('Kaist',), ('SNU',), ('Suwan',)]

In [19]:
%%sql -- Problem 7
select *
from customer
where customer_name in (
    select customer_name
    from depositor
    where customer_name not in (
        select customer_name
        from borrower
    ))

 * sqlite:///hw_1.db
Done.

[('Eun', 'chumdan', 'gwangju'),
 ('Gang', 'jiduck', 'anyang'),
 ('Hae', 'chumdan', 'gwangju'),
 ('Hyo', 'Eun', 'busan'),
 ('Ill', 'treeroad', 'Seoul'),
 ('Man', 'gyeungsu', 'anyang'),
 ('Myeong', 'bundang', 'Sungnam'),
 ('Suek', 'Eun', 'busan'),
 ('Sung', 'gyeungsu', 'anyang')]

In [24]:
%%sql -- Problem 8
select branch_name, avg(balance)
from account
group by branch_name

 * sqlite:///hw_1.db
Done.

[('BNU', 1400.0),
 ('Chumdan', 1220.0),
 ('GIST', 1035.0),
 ('GNU', 1360.0),
 ('Kaist', 1210.0),
 ('SNU', 1145.0),
 ('Suwan', 1055.0)]

In [60]:
%%sql -- Problem 9
select branch_name, count(distinct customer_name)
from loan, borrower
where loan.loan_number = borrower.loan_number
group by branch_name

 * sqlite:///hw_1.db
Done.

[('BNU', 3), ('GIST', 4), ('SNU', 4)]

In [21]:
%%sql -- Problem 10
select branch_name
from account
group by branch_name
having avg(balance) > 1200

 * sqlite:///hw_1.db
Done.

[('BNU',), ('Chumdan',), ('GNU',), ('Kaist',)]

In [22]:
%%sql -- Problem 11
select distinct S.customer_name, S.customer_street, S.customer_city
from customer as S
where not exists (
    select branch_name
    from branch
    where branch_city = 'Gwangju'
 except 
    select R.branch_name
    from depositor as T, account as R
    where T.account_number = R.account_number and
        S.customer_name = T.customer_name
);

 * sqlite:///hw_1.db
Done.

[('Eun', 'chumdan', 'gwangju'), ('Sun', 'gumnam', 'daejun')]

In [23]:
%%sql -- Problem 12
with max_balance(max_balance) as
    (select max(balance) from account)
select *
from account, max_balance
where account.balance = max_balance.max_balance;

 * sqlite:///hw_1.db
Done.

[('60002', 'Chumdan', 1580, 1580)]

In [29]:
%%sql -- Problem 13
with branch_total(branch_name, total_bal) as (
    select branch_name, sum(balance)
    from account
    group by branch_name
), avg_total_account (avg_bal) as (
    select avg(total_bal)
    from branch_total
)
select branch_name
from branch_total, avg_total_account
where total_bal > avg_bal

 * sqlite:///hw_1.db
Done.

[('Chumdan',), ('GIST',), ('Suwan',)]

In [64]:
%%sql -- Problem 14
create view all_customer as
    select branch_name, customer_name
     from depositor, account
     where depositor.account_number = account.account_number
    union
    select branch_name, customer_name
     from borrower, loan
     where borrower.loan_number = loan.loan_number

 * sqlite:///hw_1.db
(sqlite3.OperationalError) view all_customer already exists
[SQL: create view all_customer as
    select branch_name, customer_name
     from depositor, account
     where depositor.account_number = account.account_number
    union
    select branch_name, customer_name
     from borrower, loan
     where borrower.loan_number = loan.loan_number]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [66]:
%%sql -- Problem 15
delete from account
where branch_name in (
    select branch_name
    from branch
    where branch_city = 'Gwangju'
);

 * sqlite:///hw_1.db
14 rows affected.

[]

In [32]:
%%sql -- Problem 16
update account
set balance = balance * 1.05
where balance > (
    select avg(balance)
    from account
);

 * sqlite:///hw_1.db
3 rows affected.

[]